1s/ERP/Conf/Catalogs/Лико_СкладскиеСекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_СкладскиеСекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Стеллаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Стеллажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыСкладскихСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАдресов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Места</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ПаллетыВСекциях.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ПаллетыВСекциях</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Секция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_СкладскиеСекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ПараметрыПаллет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ПараметрыПаллет</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыПаллет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ТипоразмерыПаллет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ТипоразмерыПаллет</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченаПоГрузоподъемности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченаПоРазмерам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_СкладскиеСекции/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
Процедура ДобавлениеИзменениеСекций(Стеллаж) Экспорт   
	
	//Стеллаж = Справочники.Лико_Стеллажи.СоздатьЭлемент();
	Для каждого Этаж Из Стеллаж.Этажи Цикл
		НомерСекции=1;
		Пока НомерСекции<= Стеллаж.КоличествоСекций Цикл 
			
			ДобавлениеИзменениеСекции(Стеллаж, Этаж, НомерСекции);
		 
		 НомерСекции = НомерСекции+1;
	КонецЦикла;
		
		
	КонецЦикла;
	
	
	
	

КонецПроцедуры


Функция ПодобратьЯчейкуПоПаллету(Склад,Паллет,Типоразмер=Неопределено,УровеньДоступа=1) Экспорт 
	
	
	Если Типоразмер= Неопределено Тогда
		
		Структура = Справочники.Лико_Паллеты2_0.ТипоразмерПаллета(Паллет);
	Иначе
		Структура = Новый Структура;
		Структура.Вставить("Высота",Типоразмер.Высота);
		Структура.Вставить("Ширина",Типоразмер.Ширина);
		Структура.Вставить("Глубина",Типоразмер.Глубина);
		Структура.Вставить("Вес",Типоразмер.Вес);
	КонецЕсли;
	Результат = ПодобратьЯчейку(Склад, Структура.Высота,Структура.Ширина,Структура.Глубина,Структура.Вес,УровеньДоступа<>1);
	
			
	Возврат Результат; 
	
КонецФункции  


Функция ПодобратьЯчейку(Склад, Высота,Ширина,Глубина,Вес,ОбратныйПорядокВремени=Ложь) Экспорт 
	
	// ПРИОРИТЕТЫ ПОДБОРА ЯЧЕЙКИ:
	// 1. Наличие свободного места (паллет1, паллет2, паллет3)
	// 2. Остаток высоты (ОстатокВысота)
	// 3. Остаток ширины (ОстатокШирина)
	// 4. Остаток веса (ОстатокВес)
	// 5. Время доступа (ВремяДоступа) - направление зависит от параметра ОбратныйПорядокВремени
	//    - Ложь (по умолчанию): сортировка по возрастанию (выбирается ячейка с минимальным временем)
	//    - Истина: сортировка по убыванию (выбирается ячейка с максимальным временем)
	
	Результат = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СкладскиеСекции.Ссылка КАК Ссылка,
	|	Лико_СкладскиеСекции.ВерсияДанных КАК ВерсияДанных,
	|	Лико_СкладскиеСекции.ПометкаУдаления КАК ПометкаУдаления,
	|	Лико_СкладскиеСекции.Код КАК Код,
	|	Лико_СкладскиеСекции.Наименование КАК Наименование,
	|	Лико_СкладскиеСекции.Стеллаж КАК Стеллаж,
	|	Лико_СкладскиеСекции.Ряд КАК Ряд,
	|	Лико_СкладскиеСекции.Место КАК Место,
	|	Лико_СкладскиеСекции.Этаж КАК Этаж,
	|	Лико_СкладскиеСекции.Адрес1 КАК Адрес1,
	|	Лико_СкладскиеСекции.Адрес2 КАК Адрес2,
	|	Лико_СкладскиеСекции.Адрес3 КАК Адрес3,
	|	Лико_СкладскиеСекции.Типоразмер КАК Типоразмер,
	|	Лико_СкладскиеСекции.Склад КАК Склад,
	|	Лико_СкладскиеСекции.АдресЦентр КАК АдресЦентр,
	|	Лико_СкладскиеСекции.КоличествоАдресов КАК КоличествоАдресов,
	|	Лико_СкладскиеСекции.Места КАК Места,
	|	Лико_СкладскиеСекции.ВремяДоступа КАК ВремяДоступа,
	|	ВЫБОР
	|		КОГДА (Лико_СкладскиеСекции.Место - 1) / 3 + 1 <= Лико_СкладскиеСекции.Стеллаж.КоличествоСекций / 2
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК УровеньДоступа
	|ПОМЕСТИТЬ ВТСекции
	|ИЗ
	|	Справочник.Лико_СкладскиеСекции КАК Лико_СкладскиеСекции
	|ГДЕ
	|	НЕ Лико_СкладскиеСекции.ПометкаУдаления
	|	И Лико_СкладскиеСекции.Типоразмер.Глубина >= &Глубина
	|	И ВЫБОР
	|			КОГДА Лико_СкладскиеСекции.Типоразмер.НеОграниченаПоГрузоподъемности
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ Лико_СкладскиеСекции.Типоразмер.Вес >= &Вес
	|		КОНЕЦ
	|	И Лико_СкладскиеСекции.Типоразмер.Высота >= &Высота
	|	И Лико_СкладскиеСекции.Склад = &Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Лико_ПаллетыВСекцияхОстатки.Секция КАК Секция,
	|	Лико_ПаллетыВСекцияхОстатки.Паллет КАК Паллет,
	|	Лико_ПаллетыВСекцияхОстатки.Адрес КАК Адрес,
	|	Лико_ПаллетыВСекцияхОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	Лико_ПаллетыВСекцияхОстатки.ЗаблокированОстаток КАК ЗаблокированОстаток,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер КАК Типоразмер
	|ПОМЕСТИТЬ ВтОстатки
	|ИЗ
	|	РегистрНакопления.Лико_ПаллетыВСекциях.Остатки(
	|			,
	|			Адрес В
	|				(ВЫБРАТЬ
	|					ВТСекции.Адрес1 КАК Адрес
	|				ИЗ
	|					ВТСекции КАК ВТСекции
	|			
	|				ОБЪЕДИНИТЬ ВСЕ
	|			
	|				ВЫБРАТЬ
	|					ВТСекции.Адрес2
	|				ИЗ
	|					ВТСекции КАК ВТСекции
	|			
	|				ОБЪЕДИНИТЬ ВСЕ
	|			
	|				ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ВТСекции.Адрес3
	|				ИЗ
	|					ВТСекции КАК ВТСекции)) КАК Лико_ПаллетыВСекцияхОстатки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыПаллет.СрезПоследних КАК Лико_ПараметрыПаллетСрезПоследних
	|		ПО Лико_ПаллетыВСекцияхОстатки.Паллет = Лико_ПараметрыПаллетСрезПоследних.Паллет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтОстатки.Секция КАК Секция,
	|	ВтОстатки.Паллет КАК Паллет,
	|	МАКСИМУМ(ВтОстатки.Адрес) КАК Адрес,
	|	ВтОстатки.Типоразмер КАК Типоразмер,
	|	ВтОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ВтОстатки.ЗаблокированОстаток КАК ЗаблокированОстаток
	|ПОМЕСТИТЬ ВтОстаткиИтог
	|ИЗ
	|	ВтОстатки КАК ВтОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ВтОстатки.Секция,
	|	ВтОстатки.Паллет,
	|	ВтОстатки.Типоразмер,
	|	ВтОстатки.КоличествоОстаток,
	|	ВтОстатки.ЗаблокированОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСекции.Ссылка КАК Ссылка,
	|	ВТСекции.ВерсияДанных КАК ВерсияДанных,
	|	ВТСекции.ПометкаУдаления КАК ПометкаУдаления,
	|	ВТСекции.Код КАК Код,
	|	ВТСекции.Наименование КАК Наименование,
	|	ВТСекции.Стеллаж КАК Стеллаж,
	|	ВТСекции.Ряд КАК Ряд,
	|	ВТСекции.Место КАК Место,
	|	ВТСекции.Этаж КАК Этаж,
	|	ВТСекции.Адрес1 КАК Адрес1,
	|	ВТСекции.Адрес2 КАК Адрес2,
	|	ВТСекции.Адрес3 КАК Адрес3,
	|	ВТСекции.Типоразмер КАК Типоразмер,
	|	ВТСекции.Склад КАК Склад,
	|	ВТСекции.АдресЦентр КАК АдресЦентр,
	|	ВТСекции.КоличествоАдресов КАК КоличествоАдресов,
	|	ВТСекции.Места КАК Места,
	|	ВТСекции.ВремяДоступа КАК ВремяДоступа,
	|	ЕСТЬNULL(ВтОстаткиИтог.Паллет, ЗНАЧЕНИЕ(Справочник.Лико_паллеты2_0.ПустаяСсылка)) КАК Паллет1,
	|	ЕСТЬNULL(ВтОстаткиИтог1.Паллет, ЗНАЧЕНИЕ(Справочник.Лико_паллеты2_0.ПустаяСсылка)) КАК Паллет2,
	|	ЕСТЬNULL(ВтОстаткиИтог2.Паллет, ЗНАЧЕНИЕ(Справочник.Лико_паллеты2_0.ПустаяСсылка)) КАК Паллет3,
	|	ЕСТЬNULL(ВтОстаткиИтог.Типоразмер, ЗНАЧЕНИЕ(Справочник.Лико_ТипоразмерыПаллет.ПустаяСсылка)) КАК Типоразмер1,
	|	ЕСТЬNULL(ВтОстаткиИтог1.Типоразмер, ЗНАЧЕНИЕ(Справочник.Лико_ТипоразмерыПаллет.ПустаяСсылка)) КАК Типоразмер2,
	|	ЕСТЬNULL(ВтОстаткиИтог2.Типоразмер, ЗНАЧЕНИЕ(Справочник.Лико_ТипоразмерыПаллет.ПустаяСсылка)) КАК Типоразмер3,
	|	ВТСекции.УровеньДоступа КАК УровеньДоступа
	|ПОМЕСТИТЬ ВтСекцииСОстатками
	|ИЗ
	|	ВТСекции КАК ВТСекции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиИтог КАК ВтОстаткиИтог
	|		ПО ВТСекции.Адрес1 = ВтОстаткиИтог.Адрес
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиИтог КАК ВтОстаткиИтог1
	|		ПО ВТСекции.Адрес2 = ВтОстаткиИтог1.Адрес
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтОстаткиИтог КАК ВтОстаткиИтог2
	|		ПО ВТСекции.Адрес3 = ВтОстаткиИтог2.Адрес
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВтСекцииСОстатками.Ссылка КАК Ссылка,
	|	ВтСекцииСОстатками.ВерсияДанных КАК ВерсияДанных,
	|	ВтСекцииСОстатками.ПометкаУдаления КАК ПометкаУдаления,
	|	ВтСекцииСОстатками.Код КАК Код,
	|	ВтСекцииСОстатками.Наименование КАК Наименование,
	|	ВтСекцииСОстатками.Стеллаж КАК Стеллаж,
	|	ВтСекцииСОстатками.Ряд КАК Ряд,
	|	ВтСекцииСОстатками.Место КАК Место,
	|	ВтСекцииСОстатками.Этаж КАК Этаж,
	|	ВтСекцииСОстатками.Адрес1 КАК Адрес1,
	|	ВтСекцииСОстатками.Адрес2 КАК Адрес2,
	|	ВтСекцииСОстатками.Адрес3 КАК Адрес3,
	|	ВтСекцииСОстатками.Типоразмер КАК Типоразмер,
	|	ВтСекцииСОстатками.Склад КАК Склад,
	|	ВтСекцииСОстатками.АдресЦентр КАК АдресЦентр,
	|	ВтСекцииСОстатками.КоличествоАдресов КАК КоличествоАдресов,
	|	ВтСекцииСОстатками.Места КАК Места,
	|	ВтСекцииСОстатками.ВремяДоступа КАК ВремяДоступа,
	|	ВтСекцииСОстатками.Паллет1 КАК Паллет1,
	|	ВтСекцииСОстатками.Паллет2 КАК Паллет2,
	|	ВтСекцииСОстатками.Паллет3 КАК Паллет3,
	|	ВтСекцииСОстатками.Типоразмер1 КАК Типоразмер1,
	|	ВтСекцииСОстатками.Типоразмер2 КАК Типоразмер2,
	|	ВтСекцииСОстатками.Типоразмер3 КАК Типоразмер3,
	|	ВтСекцииСОстатками.Типоразмер.Ширина - (ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер1.Ширина, 0) + ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер2.Ширина, 0) + ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер3.Ширина, 0)) КАК ОстатокШирина,
	|	ВтСекцииСОстатками.Типоразмер.Вес - (ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер1.Вес, 0) + ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер2.Вес, 0) + ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер3.Вес, 0)) КАК ОстатокВес,
	|	ВтСекцииСОстатками.Типоразмер.Высота - &Высота КАК ОстатокВысота,
	|	ВЫБОР
	|		КОГДА &Ширина <= ВтСекцииСОстатками.Типоразмер.Ширина / 3
	|			ТОГДА ВЫБОР
	|					КОГДА ВтСекцииСОстатками.Паллет1 = ЗНАЧЕНИЕ(Справочник.Лико_паллеты2_0.ПустаяСсылка)
	|						ТОГДА ВтСекцииСОстатками.Адрес1
	|					КОГДА ВтСекцииСОстатками.Паллет2 = ЗНАЧЕНИЕ(Справочник.Лико_паллеты2_0.ПустаяСсылка)
	|						ТОГДА ВтСекцииСОстатками.Адрес2
	|					ИНАЧЕ ВтСекцииСОстатками.Адрес3
	|				КОНЕЦ
	|		КОГДА &Ширина > ВтСекцииСОстатками.Типоразмер.Ширина / 2
	|			ТОГДА ВтСекцииСОстатками.Адрес2
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВтСекцииСОстатками.Паллет1 = ЗНАЧЕНИЕ(Справочник.Лико_паллеты2_0.ПустаяСсылка)
	|					ТОГДА ВтСекцииСОстатками.Адрес1
	|				КОГДА ВтСекцииСОстатками.Паллет3 = ЗНАЧЕНИЕ(Справочник.Лико_паллеты2_0.ПустаяСсылка)
	|					ТОГДА ВтСекцииСОстатками.Адрес3
	|				ИНАЧЕ ВтСекцииСОстатками.Адрес2
	|			КОНЕЦ
	|	КОНЕЦ КАК Адрес,
	|	ВтСекцииСОстатками.УровеньДоступа КАК УровеньДоступа
	|ИЗ
	|	ВтСекцииСОстатками КАК ВтСекцииСОстатками
	|ГДЕ
	|	(ВтСекцииСОстатками.Паллет1 = ЗНАЧЕНИЕ(Справочник.Лико_Паллеты2_0.ПустаяСсылка)
	|			ИЛИ ВтСекцииСОстатками.Паллет2 = ЗНАЧЕНИЕ(Справочник.Лико_Паллеты2_0.ПустаяСсылка)
	|			ИЛИ ВтСекцииСОстатками.Паллет3 = ЗНАЧЕНИЕ(Справочник.Лико_Паллеты2_0.ПустаяСсылка))
	|	И ВтСекцииСОстатками.Типоразмер.Ширина - (ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер1.Ширина, 0) + ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер2.Ширина, 0) + ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер3.Ширина, 0)) > 0
	|	И ВЫБОР
	|			КОГДА ВтСекцииСОстатками.Типоразмер.НеОграниченаПоГрузоподъемности
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВтСекцииСОстатками.Типоразмер.Вес - (ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер1.Вес, 0) + ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер2.Вес, 0) + ЕСТЬNULL(ВтСекцииСОстатками.Типоразмер3.Вес, 0)) > 0
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА ВтСекцииСОстатками.Паллет2 <> ЗНАЧЕНИЕ(Справочник.Лико_Паллеты2_0.ПустаяСсылка)
	|				ТОГДА ВтСекцииСОстатками.Типоразмер2.Ширина < ВтСекцииСОстатками.Типоразмер.Ширина / 3
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	УровеньДоступа УБЫВ,
	|	ВтСекцииСОстатками.Типоразмер.НеОграниченаПоГрузоподъемности,
	|	ОстатокВысота,
	|	ОстатокШирина,
	|	ОстатокВес,
	|	ВремяДоступа УБЫВ";
	
	
	// Если параметр ОбратныйПорядокВремени = Истина, то меняем сортировку по времени на убывающую
	Если Не ОбратныйПорядокВремени Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"	ВремяДоступа УБЫВ",
			"	ВремяДоступа"); 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,
			"	УровеньДоступа УБЫВ",
			"	УровеньДоступа");

	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад",Склад );
	Запрос.УстановитьПараметр("Высота",  Высота );
	Запрос.УстановитьПараметр("Ширина",  Ширина );
	Запрос.УстановитьПараметр("Глубина", Глубина);
	Запрос.УстановитьПараметр("Вес",Вес );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат = Выборка.Адрес; 
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции  

Функция ОшибкиРазмещенияПаллетаВАдрес(Ячейка, Паллет, Типоразмер = Неопределено) Экспорт 
	
	Если Типоразмер= Неопределено Тогда
		
		Структура = Справочники.Лико_Паллеты2_0.ТипоразмерПаллета(Паллет);
	Иначе
		Структура = Новый Структура;
		Структура.Вставить("Высота",Типоразмер.Высота);
		Структура.Вставить("Ширина",Типоразмер.Ширина);
		Структура.Вставить("Глубина",Типоразмер.Глубина);
		Структура.Вставить("Вес",Типоразмер.Вес);
	КонецЕсли;

	
	
	Возврат ОшибкиРазмещенияВАдрес(Ячейка,Структура.Высота,Структура.Ширина,Структура.Глубина,Структура.Вес);

КонецФункции 

Функция ОшибкиРазмещенияВАдрес(Ячейка,Высота,Ширина,Глубина,Вес,ПолныйОтвет = Ложь) Экспорт

	// У секции есть 3 адреса
	// В секцию можно устанавливать 1, 2 или 3 паллета
	// 1. Если ширина паллета больше половины ширины секции, то в секцию можно установить только один паллет и только в средний (2) адрес
	// 2. Если ширина паллета больше 1/3 ширины секции, то в секцию можно установить 2 паллета в крайние адреса (1 и 3)
	// 3. Если ширина паллета меньше или равна 1/3 ширины секции, можно установить 3 паллета в три адреса

	
	Массив = Новый Массив();
	
	// Валидация входных параметров
	Если Не ЗначениеЗаполнено(Ячейка) Тогда
		Массив.Добавить("Ошибка: не указан адрес для размещения.");
		Возврат Массив;
	КонецЕсли;
	
	
	
	Секция = Ячейка.Лико_Секция;
	
			Структура = Новый Структура;
		Структура.Вставить("Высота", Высота);
		Структура.Вставить("Ширина", Ширина);
		Структура.Вставить("Глубина", Глубина);
		Структура.Вставить("Вес", Вес);
		
	// Получаем остатки паллетов по адресам секции
	Попытка
		СооАдресовСекции = РегистрыНакопления.Лико_ПаллетыВСекциях.ОстаткиПоАдресамСекции(Секция);
	Исключение
		Массив.Добавить("Ошибка: не удалось получить информацию об остатках паллетов в секции.");
		Возврат Массив;
	КонецПопытки;
	
	Адрес1 = СооАдресовСекции[Секция.Адрес1];
	Адрес2 = СооАдресовСекции[Секция.Адрес2];
	Адрес3 = СооАдресовСекции[Секция.Адрес3]; 
	
	// 
	ЭтоАдрес1 = Секция.Адрес1 = Ячейка;
	ЭтоАдрес2 = Секция.Адрес2 = Ячейка;
	ЭтоАдрес3 = Секция.Адрес3 = Ячейка;

	// 1.Проверка: Адрес уже занят
	Если ЗначениеЗаполнено(СооАдресовСекции[Ячейка]) Тогда
		Если ПолныйОтвет Тогда
			ДанныеАдреса = СооАдресовСекции[Ячейка];
			Массив.Добавить("Ошибка: выбранный адрес уже занят паллетом """
				+ Строка(ДанныеАдреса.Паллет) + """ ("
				+ ДанныеАдреса.Ширина + "x" + ДанныеАдреса.Глубина + "x" + ДанныеАдреса.Высота + " мм, "
				+ ДанныеАдреса.Вес + " кг). Выберите другой адрес в секции.");
		Иначе
			Массив.Добавить("Ошибка: выбранный адрес уже занят. Выберите другой адрес в секции.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;
	
	// 2.Проверка: Крайний адрес 1 конфликтует с занятым средним адресом
	Если ЭтоАдрес1 И ЗначениеЗаполнено(Адрес2) И Секция.Типоразмер.Ширина / 3 < Адрес2.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: невозможно разместить паллет в адрес 1. В среднем адресе (2) уже установлен паллет шириной "
				+ Адрес2.Ширина + " мм, что > 1/3 ширины секции (" + Секция.Типоразмер.Ширина + "/3 = "
				+ Окр(Секция.Типоразмер.Ширина / 3) + " мм). Выберите адрес 3 или другую секцию.");
		Иначе
			Массив.Добавить("Ошибка: невозможно разместить паллет в адрес 1. В среднем адресе (2) уже установлен паллет большого размера (>1/3 ширины секции). Выберите адрес 3 или другую секцию.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 3.Проверка: Крайний адрес 3 конфликтует с занятым средним адресом
	Если ЭтоАдрес3 И ЗначениеЗаполнено(Адрес2) И Секция.Типоразмер.Ширина / 3 < Адрес2.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: невозможно разместить паллет в адрес 3. В среднем адресе (2) уже установлен паллет шириной "
				+ Адрес2.Ширина + " мм, что > 1/3 ширины секции (" + Секция.Типоразмер.Ширина + "/3 = "
				+ Окр(Секция.Типоразмер.Ширина / 3) + " мм). Выберите адрес 1 или другую секцию.");
		Иначе
			Массив.Добавить("Ошибка: невозможно разместить паллет в адрес 3. В среднем адресе (2) уже установлен паллет большого размера (>1/3 ширины секции). Выберите адрес 1 или другую секцию.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 4.Проверка: Средний адрес конфликтует с занятым крайним адресом 1
	Если ЭтоАдрес2 И ЗначениеЗаполнено(Адрес1) И Секция.Типоразмер.Ширина / 3 < Адрес1.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: невозможно разместить паллет в средний адрес (2). В адресе 1 уже установлен паллет шириной "
				+ Адрес1.Ширина + " мм, что > 1/3 ширины секции (" + Секция.Типоразмер.Ширина + "/3 = "
				+ Окр(Секция.Типоразмер.Ширина / 3) + " мм), что блокирует размещение в центре. Используйте адрес 3 или выберите другую секцию.");
		Иначе
			Массив.Добавить("Ошибка: невозможно разместить паллет в средний адрес (2). В адресе 1 уже установлен паллет большого размера, что блокирует размещение в центре. Используйте адрес 3 или выберите другую секцию.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 5.Проверка: Средний адрес конфликтует с занятым крайним адресом 3
	Если ЭтоАдрес2 И ЗначениеЗаполнено(Адрес3) И Секция.Типоразмер.Ширина / 3 < Адрес3.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: невозможно разместить паллет в средний адрес (2). В адресе 3 уже установлен паллет шириной "
				+ Адрес3.Ширина + " мм, что > 1/3 ширины секции (" + Секция.Типоразмер.Ширина + "/3 = "
				+ Окр(Секция.Типоразмер.Ширина / 3) + " мм), что блокирует размещение в центре. Используйте адрес 1 или выберите другую секцию.");
		Иначе
			Массив.Добавить("Ошибка: невозможно разместить паллет в средний адрес (2). В адресе 3 уже установлен паллет большого размера, что блокирует размещение в центре. Используйте адрес 1 или выберите другую секцию.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 6.Проверка: Средний адрес не подходит для крупного паллета при занятом адресе 1
	Если ЭтоАдрес2 И ЗначениеЗаполнено(Адрес1) И Секция.Типоразмер.Ширина / 3 < Структура.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: паллет слишком широк ("
				+ Структура.Ширина + " мм > 1/3 ширины секции = " + Секция.Типоразмер.Ширина + "/3 = "
				+ Окр(Секция.Типоразмер.Ширина / 3) + " мм) для размещения в среднем адресе (2), так как адрес 1 уже занят. Используйте адрес 3 или выберите другую секцию.");
		Иначе
			Массив.Добавить("Ошибка: паллет слишком широк (>1/3 ширины секции) для размещения в среднем адресе (2), так как адрес 1 уже занят. Используйте адрес 3 или выберите другую секцию.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 7.Проверка: Средний адрес не подходит для крупного паллета при занятом адресе 3
	Если ЭтоАдрес2 И ЗначениеЗаполнено(Адрес3) И Секция.Типоразмер.Ширина / 3 < Структура.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: паллет слишком широк ("
				+ Структура.Ширина + " мм > 1/3 ширины секции = " + Секция.Типоразмер.Ширина + "/3 = "
				+ Окр(Секция.Типоразмер.Ширина / 3) + " мм) для размещения в среднем адресе (2), так как адрес 3 уже занят. Используйте адрес 1 или выберите другую секцию.");
		Иначе
			Массив.Добавить("Ошибка: паллет слишком широк (>1/3 ширины секции) для размещения в среднем адресе (2), так как адрес 3 уже занят. Используйте адрес 1 или выберите другую секцию.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;
	
	// 8.Проверка: Крайний адрес 1 не подходит для крупного паллета
	Если ЭтоАдрес1 И Секция.Типоразмер.Ширина / 2 < Структура.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: паллет слишком широк ("
				+ Структура.Ширина + " мм > 1/2 ширины секции = " + Секция.Типоразмер.Ширина + "/2 = "
				+ Окр(Секция.Типоразмер.Ширина / 2) + " мм) для размещения в адресе 1. Используйте средний адрес (2) или выберите другую секцию.");
		Иначе
			Массив.Добавить("Ошибка: паллет слишком широк (>1/2 ширины секции) для размещения в адресе 1. Используйте средний адрес (2) или выберите другую секцию.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 9.Проверка: Крайний адрес 3 не подходит для крупного паллета
	Если ЭтоАдрес3 И Секция.Типоразмер.Ширина / 2 < Структура.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: паллет слишком широк ("
				+ Структура.Ширина + " мм > 1/2 ширины секции = " + Секция.Типоразмер.Ширина + "/2 = "
				+ Окр(Секция.Типоразмер.Ширина / 2) + " мм) для размещения в адресе 3. Используйте средний адрес (2) или выберите другую секцию.");
		Иначе
			Массив.Добавить("Ошибка: паллет слишком широк (>1/2 ширины секции) для размещения в адресе 3. Используйте средний адрес (2) или выберите другую секцию.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 10.Проверка: Ширина паллета превышает ширину секции
	Если Секция.Типоразмер.Ширина < Структура.Ширина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: ширина паллета " + Структура.Ширина
				+ " мм превышает максимальную ширину секции " + Секция.Типоразмер.Ширина
				+ " мм (превышение на " + (Структура.Ширина - Секция.Типоразмер.Ширина)
				+ " мм). Паллет не может быть размещен в данной секции.");
		Иначе
			Массив.Добавить("Ошибка: ширина паллета превышает максимальную ширину секции. Паллет не может быть размещен в данной секции.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 11.Проверка: Высота паллета превышает высоту секции
	Если Секция.Типоразмер.Высота < Структура.Высота Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: высота паллета " + Структура.Высота
				+ " мм превышает максимальную высоту секции " + Секция.Типоразмер.Высота
				+ " мм (превышение на " + (Структура.Высота - Секция.Типоразмер.Высота)
				+ " мм). Паллет не может быть размещен в данной секции.");
		Иначе
			Массив.Добавить("Ошибка: высота паллета превышает максимальную высоту секции. Паллет не может быть размещен в данной секции.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;

	// 12.Проверка: Глубина паллета превышает глубину секции
	Если Секция.Типоразмер.Глубина < Структура.Глубина Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: глубина паллета " + Структура.Глубина
				+ " мм превышает максимальную глубину секции " + Секция.Типоразмер.Глубина
				+ " мм (превышение на " + (Структура.Глубина - Секция.Типоразмер.Глубина)
				+ " мм). Паллет не может быть размещен в данной секции.");
		Иначе
			Массив.Добавить("Ошибка: глубина паллета превышает максимальную глубину секции. Паллет не может быть размещен в данной секции.");
		КонецЕсли;
		//Возврат Массив;
	КонецЕсли;
	
	// 13.Проверка: Общий вес превышает грузоподъемность секции
	ВесТекущий = ?(ЗначениеЗаполнено(Адрес1), Адрес1.Вес, 0)
		+ ?(ЗначениеЗаполнено(Адрес2), Адрес2.Вес, 0)
		+ ?(ЗначениеЗаполнено(Адрес3), Адрес3.Вес, 0);
	ВесВсего = ВесТекущий + Структура.Вес;

	Если Не Секция.Типоразмер.НеОграниченаПоГрузоподъемности
		И Секция.Типоразмер.Вес < ВесВсего Тогда
		Если ПолныйОтвет Тогда
			Массив.Добавить("Ошибка: общий вес " + ВесВсего
				+ " кг (текущий: " + ВесТекущий + " кг + новый: " + Структура.Вес
				+ " кг) превышает грузоподъемность секции " + Секция.Типоразмер.Вес
				+ " кг (превышение на " + (ВесВсего - Секция.Типоразмер.Вес) + " кг).");
		Иначе
			Массив.Добавить("Ошибка: общий вес паллетов в секции превышает максимальную грузоподъемность секции.");
		КонецЕсли;
	КонецЕсли;

	Возврат Массив;
КонецФункции 


#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавлениеИзменениеСекции(Стеллаж, Этаж, НомерСекции) 
	
	Место=(НомерСекции - 1) * 3 + 1;

	Код = КодСекции( Стеллаж.КодПолный,Место,Этаж.НомерСтроки);
	
	Секция =Секция( Стеллаж, Этаж.НомерСтроки, Код);
	
	Если ЗначениеЗаполнено(Секция) Тогда 
		
		Секция = Секция.ПолучитьОбъект();
		
	Иначе
		Секция = Справочники.Лико_СкладскиеСекции.СоздатьЭлемент();
		
	КонецЕсли;
	
	
	Секция.Стеллаж           = Стеллаж;
	Секция.Склад             = Стеллаж.Склад;
	Секция.Этаж              = Этаж.НомерСтроки;
	Секция.Типоразмер        = Этаж.Типоразмер;
	Секция.Ряд               = Стеллаж.КодПолный;
	Секция.Место             = Место;
	Секция.Места             = СтрШаблон("%1-%2-%3", Секция.Место, Секция.Место + 1, Секция.Место + 2);
	Секция.Адрес1            = АдресХранения(Секция.Ряд,Секция.Место,Секция.Этаж);
	Секция.Адрес2            = АдресХранения(Секция.Ряд,Секция.Место+1,Секция.Этаж);
	Секция.Адрес3            = АдресХранения(Секция.Ряд,Секция.Место+2,Секция.Этаж);
	Секция.АдресЦентр        = Секция.Адрес2;
	Секция.КоличествоАдресов = 3;
	
	Секция.Записать();
	
	ЗаписатьСекциюВАдрес(Секция.Ссылка);
	
	

КонецФункции

Функция Секция(Стеллаж, Этаж, НомерСекции) 
	Результат=Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_СкладскиеСекции.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Лико_СкладскиеСекции КАК Лико_СкладскиеСекции
	|ГДЕ
	|	Лико_СкладскиеСекции.Стеллаж = &Стеллаж
	|	И Лико_СкладскиеСекции.Код = &НомерСекции
	|	И Лико_СкладскиеСекции.Этаж = &Этаж";
	Запрос.УстановитьПараметр("Стеллаж",Стеллаж );
	Запрос.УстановитьПараметр("Этаж",Этаж );
	Запрос.УстановитьПараметр("НомерСекции",НомерСекции);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Выборка.Ссылка;
	КонецЦикла; 
	
	
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьСекциюВАдрес(Секция) 
	
	СпрОбъект =  Секция.Адрес1.ПолучитьОбъект();
	СпрОбъект.Лико_Секция =Секция;
	СпрОбъект.Записать(); 
	
	СпрОбъект =  Секция.Адрес2.ПолучитьОбъект();
	СпрОбъект.Лико_Секция =Секция;
	СпрОбъект.Записать();

	
	СпрОбъект =  Секция.Адрес3.ПолучитьОбъект();
	СпрОбъект.Лико_Секция =Секция;
	СпрОбъект.Записать();


КонецПроцедуры 

Функция АдресХранения(Ряд, Место, Этаж) 
	
	 Результат = Неопределено;
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкладскиеЯчейки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СкладскиеЯчейки КАК СкладскиеЯчейки
	|ГДЕ
	|	НЕ СкладскиеЯчейки.ЭтоГруппа
	|	И СкладскиеЯчейки.Код = &Код";
	
	Код = СтрШаблон("Р%1М%2Э%3",Ряд,Место,Этаж);

	Запрос.УстановитьПараметр("Код",Код );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		
		Результат = Выборка.Ссылка;
	
	КонецЦикла; 
	
	
	
	Возврат Результат;

КонецФункции

Функция КодСекции(Ряд, Место, Этаж) Экспорт  	
	
	Места = СтрШаблон("%1-%2-%3", Место, Место + 1, Место + 2);
	Код   = СтрШаблон("Р%1-М(%2-%3-%4)-Э%5"
		,Ряд
		,Формат(Место,"ЧЦ=2; ЧВН=")
		,Формат(Место+1,"ЧЦ=2; ЧВН=")
		,Формат(Место+2,"ЧЦ=2; ЧВН=")
		,Формат(Этаж,"ЧЦ=2; ЧВН=")); 
		
		Возврат Код;
	
КонецФункции  


#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
